video-generation-platform/backend/tests/performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 15
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: "./load-test-processor.js"

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "API Authentication"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test@example.com"
            password: "testpassword"
          capture:
            - json: "$.token"
              as: "authToken"

  - name: "Video Generation Request"
    weight: 50
    flow:
      - post:
          url: "/api/v1/videos"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Test Video {{ $randomString() }}"
            description: "Load test video"
            duration: 30
          expect:
            - statusCode: [200, 201, 202]